import os

BOT_TOKEN = os.environ.get("BOT_TOKEN", "")

# Week number from start of the year
START_WEEK = 6
EVEN_WEEK = {
    1: [
        (2, "Математический анализ - Стромынка каб. 20"),
        (3, "Математический анализ - Стромынка каб. 20"),
        (4, "Линейная алгебра - Стромынка каб. 20")
    ],
    2: [
        (1, "Физика - Дистант"),
        (2, "Физика - Дистант"),
        (3, "Информационные технологии в правоохранительной сфере - Дистант"),
        (4, "Линейная алгебра - Дистант"),
        (5, "Языки программирования - Дистант")
    ],
    3: [
        (1, "Физика - Вернадка каб. B-413"),
        (2, "Физика - Вернадка каб. B-413"),
    ],
    4: [
        (1, "Дискретная математика - Стромынка каб. 259"),
        (2, "Языки программирования - Стромынка каб. 239а"),
    ],
}
UNEVEN_WEEK = {
    1: [
        (4, "Линейная алгебра - Стромынка каб. 20")
    ],
    2: [
        (2, "Дискретная математика - Дистант"),
        (3, "Дискретная математика - Дистант"),
        (4, "Линейная алгебра - Дистант")
    ],
    3: [
        (1, "Математический анализ - Дистант"),
        (2, "Математический анализ - Дистант"),
        (3, "Правоведение - Дистант"),
        (4, "Физра - Дистант"),
        (5, "Физра - Дистант")
    ],
    4: [
        (1, "Дискретная математика - Стромынка каб.259"),
        (2, "Языки программирования - Стромынка каб. 239а")
    ]
}
SPECIALS = {
    (3, 2): [
        (3, "Информационные системы - Вернадка каб. E-40"),
        (4, "Информационные системы - Вернадка каб. E-40")
    ],
    (3, 4): [
        (3, "Физика - Вернадка каб. B-411"),
        (4, "Физика - Вернадка каб. B-411")
    ],
    (3, 6): [
        (3, "Информационные системы - Вернадка каб. E-40"),
        (4, "Информационные системы - Вернадка каб. E-40")
    ],
    (3, 8): [
        (3, "Физика - Вернадка каб. B-411"),
        (4, "Физика - Вернадка каб. B-411")
    ],
    (3, 10): [
        (3, "Информационные системы - Вернадка каб. E-40"),
        (4, "Информационные системы - Вернадка каб. E-40")
    ],
    (3, 12): [
        (3, "Физика - Вернадка каб. B-411"),
        (4, "Физика - Вернадка каб. B-411")
    ],
    (3, 14): [
        (3, "Информационные системы - Вернадка каб. E-40"),
        (4, "Информационные системы - Вернадка каб. E-40")
    ],
    (3, 16): [
        (3, "Физика - Вернадка каб. B-411"),
        (4, "Физика - Вернадка каб. B-411")
    ],
}
LESSONS_TIME = {
    1: "9:00 - 10:30",
    2: "10:40 - 12:10",
    3: "12:40 - 14:10",
    4: "14:20 - 15:50",
    5: "16:20 - 17:50",
    6: "18:00 - 19:30"
}
WEEKDAY_NAMES = {
    1: "Понедельник",
    2: "Вторник",
    3: "Среда",
    4: "Четверг",
    5: "Пятница",
    6: "Суббота",
    7: "Воскресенье",
}
